# Создать телефонный справочник с возможностью импорта и экспорта данных в формате .txt. 
# Фамилия, имя, отчество, номер телефона - данные, которые должны находиться в файле.
# 1. Программа должна выводить данные
# 2. Программа должна сохранять данные в текстовом файле
# 3. Пользователь может ввести одну из характеристик для поиска определенной записи
# 	(Например имя или фамилию человека)
# 4. Использование функций. Ваша программа не должна быть линейной
# 5. Реализовать функционал для изменения и удаления данных. Пользователь также может ввести имя или фамилию
# 6. Дополнить справочник возможностью копирования данных из одного файла в другой. 
#    Пользователь вводит номер строки, которую необходимо перенести из одного файла в другой.

# функция вывода данных
def show_data():
    pass

# функция чтения данных
def read_data():
    pass

# функция записи данных
def write_data():
    pass

# функция поиска данных
def search_data():
    pass

# функция редактирования данных
def edit_data():
    pass

# функция удаления данных
def del_data():
    pass

# функция копирования данных
def copy_data():
    pass

# Код действий пользователя
def show_data():
    pass

if __name__ == '__main__':
    main()




